Autodesk.Revit.DB.BaseArray.Label
The family parameter label of the BaseArray.
Remarks:
The label associates the number of members of the array with a family parameter.
A BaseArray only can be labeled in a family document and only can be labeled to a integer FamilyParameter.
To unbind the family parameter, set this property to null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the family parameter's ParameterType is not ParameterType.Integer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when trying to label the BaseArray out of family document.

Autodesk.Revit.DB.BaseArray.Name
Get and Set the Name property
Remarks: The method set is override to forbid the user to change the Name. When the user tries
to call the method set for BaseArray object, an InvalidOperationException will be thrown.

Autodesk.Revit.DB.BaseArray.GetCopiedMemberIds
Retrieves the copied member Ids of the Array.
Returns: The copied member Ids of the Array
Since: 2013

Autodesk.Revit.DB.BaseArray.GetOriginalMemberIds
Retrieves the original member Ids of the Array.
Returns: The original member Ids of the Array
Since: 2013

Autodesk.Revit.DB.BaseArray.NumMembers
Retrieves or changes the number of the arrayed members.

Autodesk.Revit.DB.BaseArray
An abstract base class that represents an array within the Revit project.